# Import libraries

In [3]:
import pandas as pd

Here we read the contain in the dataset

In [12]:
df = pd.read_csv("student_data.csv")

Check first 5 enteries in the dataset

In [14]:
df.head()

   Roll No    Name  Marks    City Gender
0        1    Amit     85    Pune      M
1        2    Neha     78  Mumbai      F
2        3     Raj     90   Thane      M
3        4   Priya     88  Nashik      F
4        5  Suresh     76  Nagpur      M

Fetch last 5 records

In [16]:
df.tail()

    Roll No    Name  Marks      City Gender
25       26    Ritu     69    Pimpri      F
26       27  Deepak     93   Solapur      M
27       28   Jyoti     72  Lonavala      F
28       29   Sunil     97  Kolhapur      M
29       30   Komal     68    Satara      F

In [99]:
df.shape

(30, 5)

In [22]:
print("There are",df.shape[0], "rows and",df.shape[1],"columns in the dataset. ")

There are 30 rows and 5 columns in the dataset.

Here we analyse the no of rows and columns in the dataset

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Roll No  30 non-null     int64
 1   Name     30 non-null     object
 2   Marks    30 non-null     int64
 3   City     30 non-null     object
 4   Gender   30 non-null     object
dtypes: int64(2), object(3)
memory usage: 1.3+ KB

In [26]:
df.describe()

         Roll No      Marks
count  30.000000  30.000000
mean   15.500000  83.066667
std     8.803408   8.581991
min     1.000000  68.000000
25%     8.250000  76.250000
50%    15.500000  83.500000
75%    22.750000  89.750000
max    30.000000  97.000000

Here we analyse  the mean,overall count min and max value

In [28]:
df.isnull

<bound method DataFrame.isnull of     Roll No    Name  Marks      City Gender
0         1    Amit     85      Pune      M
1         2    Neha     78    Mumbai      F
2         3     Raj     90     Thane      M
3         4   Priya     88    Nashik      F
4         5  Suresh     76    Nagpur      M
5         6   Pooja     81    Pimpri      F
6         7  Vikram     95   Solapur      M
7         8  Anjali     87  Lonavala      F
8         9    Arun     74  Kolhapur      M
9        10   Kiran     89    Satara      M
10       11   Rohit     92      Pune      M
11       12   Sneha     80    Mumbai      F
12       13   Manoj     77     Thane      M
13       14   Divya     84    Nashik      F
14       15  Sanjay     86    Nagpur      M
15       16  Kavita     79    Pimpri      F
16       17  Rakesh     91   Solapur      M
17       18   Meena     83  Lonavala      F
18       19  Sachin     75  Kolhapur      M
19       20   Nidhi     82    Satara      F
20       21    Anil     88      Pune      M
21       22   Swati     70    Mumbai      F
22       23  Vishal     94     Thane      M
23       24  Preeti     73    Nashik      F
24       25  Chetan     96    Nagpur      M
25       26    Ritu     69    Pimpri      F
26       27  Deepak     93   Solapur      M
27       28   Jyoti     72  Lonavala      F
28       29   Sunil     97  Kolhapur      M
29       30   Komal     68    Satara      F>

In [30]:
df["Marks"].isna()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
Name: Marks, dtype: bool

In [32]:
df["Marks"].isna().sum()

0

In [36]:
import numpy as np

#import numpy library for numerical analyzation

In [42]:
# calculate the mean 

mean_att=df['Marks'].mean()

In [44]:
df.columns

Index(['Roll No', 'Name', 'Marks', 'City', 'Gender'], dtype='object')

In [46]:
# print the mean
print(mean_att)

83.06666666666666

In [52]:
# calculate the mode 
mode=df['Marks'].mode()

In [54]:
df.columns

Index(['Roll No', 'Name', 'Marks', 'City', 'Gender'], dtype='object')

In [56]:
# print the mode
print(mode)

0    88
Name: Marks, dtype: int64

In [58]:
# claculate the median
median_att=df['Marks'].median()

In [60]:
df.columns

Index(['Roll No', 'Name', 'Marks', 'City', 'Gender'], dtype='object')

In [62]:
# print median
print(median_att)

83.5

In [64]:
# calculate the variance
var=df['Marks'].var()

In [66]:
df.columns

Index(['Roll No', 'Name', 'Marks', 'City', 'Gender'], dtype='object')

In [68]:
# print the variance
print(var)

73.65057471264369

In [70]:
# calculate the standard deviation
std=df['Marks'].std()

In [72]:
df.columns

Index(['Roll No', 'Name', 'Marks', 'City', 'Gender'], dtype='object')

In [74]:
#print the standard deviation
print(std)

8.58199130229364